[
    {
        "sectionID": "About",
        "blurb": "Hi, my name is Caleb Gibson and I am a senior at the Univeristy of Pittsburgh. Here's some more info about me!",
        "contentText": "I am a 22 year old Computer Engineering student at Pitt. I am getting a minor in Physics and have grown to appreciate Embedded Systems Design, Robotics, FPGA Design, and Automation type of projects.I am currently looking for an internship for Summer, 2023 and for full time Workafter I graduate in Decemeber 2023! I am looking for positions in Web Development, Automation, General Software Engineering, and Embedded System Engineering."
    },
    {
        "sectionID": "EPortfolio",
        "blurb": "I'd love the chance to share some of my projects with you. Here are some of the projects I am most excited about!",
        "contentText": "TODO: add some content"
    },
    {
        "sectionID": "CourseWork",
        "blurb": "I'm wrapping up my final year as a Computer Engineering Student at Pitt, Here are some of my most challenging and relevant courses that I've completed.",
        "contentText": "Fall - 2022:\\nEmbedded System Design - In this class, we used a Raspberry Pi for our labs, where learned about what goes into designing embedded systems. In every lab, I became more familiar with the linux kernel, the RaspberryPi system, and C and Python coding. I utilitzed many I/O attachements compatible with the Pi, such as an LED matrix, a Gyroscope, and a joystick and directly controlled them by writing python code. I also wrote C code to write system interrupts using the linux kernel. I used C code to create a program to monitor cache memory hits and misses, directly control the GPIO registers of the computer, develop a real-time-scheduling program that would take into account the priority of different threads and schedule them accordingly. My personal favorite lab was where I wrote a custom CPU power regulator that is based on the userspace power governor. It allowed me to monitor how hard the cpu is working, and increase the clock frequency automatically to compensate by reading values directly from the system directory.\\n\\nAdvanced Digitial Design - In this class, I was tasked with creating hardware implementations for solutions using an FPGA and the vivado editor. I was able to create some basic electronic components via the FPGA, such as registers, an ALU, and some logical operation components. This quickly escalated to building a (mostly) working 32-bit 8 cycle MIPS CPU. This monster of a project required weeks of planning, routing a custom datapath, and pouring over a unique Finite State Machine, all made from scratch. We also learned how to use the Accelerated Hardware of the FPGA to take software solutions to problems like image convolution, and make them faster by implementing the hardware design.\\n\\nComputer Networks - This class was one where I was able to learn about and simulate many difffernt kinds of networks, which is invaluable to the learning of a computer engineer. Using Matlab and Simululink, I was able to simulate different queing processes and learn about the effeciencies of different networks.\\n\\nModern Physics - While not one's first thought when considering Computer Engineering, I've always had a love of physics and the natural working of things. In this class, I was able to explore more about Einstein's theory of special relativity, learn much about Quantum Mechanincs and how atoms behave on the smallest scale that we observe in the universe, as well as their many effects on today's technology, in both computational devices and medicinal ones."
    }
]